xively/xively-client-c/examples/cc3200/xively_demo/main.c
/* Copyright (c) 2003-2016, LogMeIn, Inc. All rights reserved.
 *
 * This is part of the Xively C Client library,
 * it is licensed under the BSD 3-Clause license.
 */

//*****************************************************************************
//
// Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/
//
//
//  Redistribution and use in source and binary forms, with or without
//  modification, are permitted provided that the following conditions
//  are met:
//
//    Redistributions of source code must retain the above copyright
//    notice, this list of conditions and the following disclaimer.
//
//    Redistributions in binary form must reproduce the above copyright
//    notice, this list of conditions and the following disclaimer in the
//    documentation and/or other materials provided with the
//    distribution.
//
//    Neither the name of Texas Instruments Incorporated nor the names of
//    its contributors may be used to endorse or promote products derived
//    from this software without specific prior written permission.
//
//  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
//  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
//  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
//  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
//  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
//  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
//  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
//  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
//  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
//  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
//  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
//
//*****************************************************************************

// Simplelink includes
#include "simplelink.h"

// Driverlib includes
#include "hw_gpio.h"
#include "hw_ints.h"
#include "hw_memmap.h"
#include "hw_types.h"
#include "interrupt.h"
#include "pin.h"
#include "prcm.h"
#include "rom.h"
#include "rom_map.h"
#include "utils.h"
#include "gpio.h"

// Common interface includes
#include "button_if.h"
#include "common.h"
#include "gpio_if.h"
#include "i2c_if.h"
#include "pinmux.h"
#include "tmp006drv.h"

// required by sprintf
#include <stdio.h>

#ifndef NOTERM
#include "uart_if.h"
#endif

#define APPLICATION_NAME "XIVELY_CC3200_DEMO_APP"
#define APPLICATION_VERSION "0.0.1"
#define SUCCESS 0

// Values for below macros shall be modified per the access-point's (AP) properties.
// SimpleLink device will connect to following AP when the application is executed.
#define ENT_NAME "YOUR_WIFI_BSSID"
#define PASSWORD "YOUR_WIFI_PASSWORD"

// Values for below macros will be used for connecting the device to Xively's
// MQTT broker
#define XIVELY_DEVICE_ID "YOUR_XIVELY_DEVICE_ID"
#define XIVELY_DEVICE_PASSWORD "YOUR_XIVELY_DEVICE_PASSWORD"
#define XIVELY_ACCOUNT_ID "YOUR_XIVELY_ACCOUNT_ID"

// Application specific status/error codes
typedef enum {
    // Choosing -0x7D0 to avoid overlap w/ host-driver's error codes
    LAN_CONNECTION_FAILED      = -0x7D0,
    DEVICE_NOT_IN_STATION_MODE = LAN_CONNECTION_FAILED - 1,
    STATUS_CODE_MAX            = -0xBB8
} e_AppStatusCodes;

//*****************************************************************************
//                 GLOBAL VARIABLES -- Start
//*****************************************************************************
volatile unsigned long g_ulStatus = 0;              // SimpleLink Status
unsigned long g_ulGatewayIP       = 0;              // Network Gateway IP address
unsigned char g_ucConnectionSSID[SSID_LEN_MAX + 1]; // Connection SSID
unsigned char g_ucConnectionBSSID[BSSID_LEN_MAX];   // Connection BSSID

#if defined( ccs )
extern void ( *const g_pfnVectors[] )( void );
#endif
#if defined( ewarm )
extern uVectorEntry __vector_table;
#endif
//*****************************************************************************
//                 GLOBAL VARIABLES -- End
//*****************************************************************************

//****************************************************************************
//                      LOCAL FUNCTION PROTOTYPES
//****************************************************************************
long MainLogic();
static void BoardInit( void );
static void InitializeAppVariables();
void ConnectToXively();
void WaitForWlanEvent();

/******************************************************************************/
/* BEGINNING OF XIVELY CODE */
/******************************************************************************/

/* Includes used by the code below. */
#include <time.h>
#include <xi_bsp_rng.h>
#include <xi_bsp_time.h>
#include <xively.h>

/******************************************************************************/
/* BEGINNING OF XIVELY CODE GLOBAL SECTION */
/******************************************************************************/

/* Names of the MQTT topics used by this application */
const char* const gTempratureTopicName =
    "xi/blue/v1/" XIVELY_ACCOUNT_ID "/d/" XIVELY_DEVICE_ID "/Temperature";
const char* const gGreenLedTopicName =
    "xi/blue/v1/" XIVELY_ACCOUNT_ID "/d/" XIVELY_DEVICE_ID "/Green LED";
const char* const gOrangeLedTopicName =
    "xi/blue/v1/" XIVELY_ACCOUNT_ID "/d/" XIVELY_DEVICE_ID "/Orange LED";
const char* const gRedLedTopicName =
    "xi/blue/v1/" XIVELY_ACCOUNT_ID "/d/" XIVELY_DEVICE_ID "/Red LED";
const char* const gButtonSW2TopicName =
    "xi/blue/v1/" XIVELY_ACCOUNT_ID "/d/" XIVELY_DEVICE_ID "/Button SW2";
const char* const gButtonSW3TopicName =
    "xi/blue/v1/" XIVELY_ACCOUNT_ID "/d/" XIVELY_DEVICE_ID "/Button SW3";

/* Required by push button interrupt handlers - there is no space for user argument so we
 * can't pass the xively's context handler as a function argument. */
xi_context_handle_t gXivelyContextHandle = -1;

/* Used to store the temperature timed task handles. */
xi_timed_task_handle_t gSendTempratureHandle = -1;

