xively/xively-client-c/examples/cc3200/xively_demo/main.c
/* Used by onLed handler function to differentiate LED's */
const static ledNames gGreenLed  = MCU_GREEN_LED_GPIO;
const static ledNames gOrangeLed = MCU_ORANGE_LED_GPIO;
const static ledNames gRedLed    = MCU_RED_LED_GPIO;

/******************************************************************************/
/* END OF XIVELY CODE GLOBAL SECTION */
/******************************************************************************/

/**
* @brief Event handler for SW2 button press/release interrupts.
 *
 * If the button was pushed the pinValue will be 1 if it was released 0.
 * @note This function uses the global variable of gXivelyContextHandle - the button_if
 * implementation doesn't provide alternative.
 */
void pushButtonInterruptHandlerSW2()
{
    int pinValue = GPIOPinRead( GPIOA2_BASE, GPIO_PIN_6 );

    if ( pinValue == 0 )
    {
        xi_publish( gXivelyContextHandle, gButtonSW2TopicName, "0",
                    XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
    }
    else
    {
        xi_publish( gXivelyContextHandle, gButtonSW2TopicName, "1",
                    XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
    }

    Button_IF_EnableInterrupt( SW2 );
}

/**
 * @brief Event handler for SW2 button press/release interrupts.
 *
 * If the button was pushed the pinValue will be 1 if it was released 0.
 * @note This function uses the global variable of gXivelyContextHandle - the button_if
 * implementation doesn't provide alternative.
 */
void pushButtonInterruptHandlerSW3()
{
    int pinValue = GPIOPinRead( GPIOA1_BASE, GPIO_PIN_5 );

    if ( pinValue == 0 )
    {
        xi_publish( gXivelyContextHandle, gButtonSW3TopicName, "0",
                    XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
    }
    else
    {
        xi_publish( gXivelyContextHandle, gButtonSW3TopicName, "1",
                    XI_MQTT_QOS_AT_MOST_ONCE, XI_MQTT_RETAIN_FALSE, NULL, NULL );
    }

    Button_IF_EnableInterrupt( SW3 );
}

/**
 * @brief Function that handles events related to the LEDs' topics messages and
 * subscription status changes.
 *
 * @note For more details please refer to the xively.h - xi_subscribe function.
 *
 * @param in_context_handle - xively library context required for calling API functions
 * @param call_type - describes if the handler was called carrying the subscription
 * operation result or the incoming message
 * @oaram params - structure with data
 * @param state - state of the operation
 * @oaram user_data - pointer attached to the topic
 */
void onLedTopic( xi_context_handle_t in_context_handle,
                 xi_sub_call_type_t call_type,
                 const xi_sub_call_params_t* const params,
                 xi_state_t state,
                 void* user_data )
{
    switch ( call_type )
    {
        case XI_SUB_CALL_SUBACK:
            if ( params->suback.suback_status == XI_MQTT_SUBACK_FAILED )
            {
                UART_PRINT( "topic:%s. Subscription failed.\n", params->suback.topic );
            }
            else
            {
                UART_PRINT( "topic:%s. Subscription granted %d.\n", params->suback.topic,
                            ( int )params->suback.suback_status );
            }
            return;
        case XI_SUB_CALL_MESSAGE:
        {
            if ( params->message.temporary_payload_data_length == 1 )
            {
                ledNames ledName = *( ( ledNames* )user_data );

                switch ( params->message.temporary_payload_data[0] )
                {
                    case 48:
                        UART_PRINT( "topic:%s off %d\r\n", params->suback.topic,
                                    ( int )ledName );
                        GPIO_IF_LedOff( ledName );
                        break;
                    case 49:
                        UART_PRINT( "topic:%s on %d\r\n", params->suback.topic,
                                    ( int )ledName );
                        GPIO_IF_LedOn( ledName );
                        break;
                    default:
                        UART_PRINT( "unexpected value on topic %s \r\n",
                                    params->message.topic );
                        break;
                }
            }
            else
            {
                UART_PRINT( "unexpected data length on topic %s \r\n",
                            params->message.topic );
            }
        }
            return;
        default:
            return;
    }
}

/**
 * @brief Implementation of recurring time task that sends updates on temperature sensor
 * on each invocation.
 *
 * @note for more details about user time tasks please refer to the xively.h -
 * xi_schedule_timed_task function.
 *
 * @param context_handle - xively library context required for calling API functions
 * @param timed_task_handle - handle to *this* timed task, can be used to re-schedule or
 * cancel the task
 * @param user_data - data assosicated with this timed task
 */
void send_temprature( const xi_context_handle_t context_handle,
                      const xi_timed_task_handle_t timed_task_handle,
                      void* user_data )
{
    /* Prepare configuration for temperature sensor for I2C bus */
    PinTypeI2C( PIN_01, PIN_MODE_1 );
    PinTypeI2C( PIN_02, PIN_MODE_1 );

    int lRetVal        = -1;
    float fCurrentTemp = .0f;
    char msg[16]       = {'\0'};

    /* I2C Init */
    lRetVal = I2C_IF_Open( I2C_MASTER_MODE_FST );
    if ( lRetVal < 0 )
    {
        ERR_PRINT( lRetVal );
        goto end;
    }

    /* Init Temprature Sensor */
    lRetVal = TMP006DrvOpen();
    if ( lRetVal < 0 )
    {
        ERR_PRINT( lRetVal );
        goto end;
    }

    TMP006DrvGetTemp( &fCurrentTemp );

    sprintf( ( char* )&msg, "%5.02f", fCurrentTemp );
    xi_publish( context_handle, gTempratureTopicName, msg, XI_MQTT_QOS_AT_MOST_ONCE,
                XI_MQTT_RETAIN_FALSE, NULL, NULL );

    do
    {
    } while ( I2C_IF_Close() != 0 );

end:
    /* Restore configuration for LED control */
    PinTypeGPIO( PIN_01, PIN_MODE_0, false );
    GPIODirModeSet( GPIOA1_BASE, 0x4, GPIO_DIR_MODE_OUT );

    PinTypeGPIO( PIN_02, PIN_MODE_0, false );
    GPIODirModeSet( GPIOA1_BASE, 0x8, GPIO_DIR_MODE_OUT );
}

/**
 * @brief Handler function for eventa related to changes in connection state.
 *
 * @note for more details please refer to xively.h - xi_connect function.
 *
 * @param context_handle - xively library context required for calling API functions
 * @param data - points to the structure that holds detailed information about the
 * connection state and settings
 * @param - state additional internal state of the library helps to determine the reason
 * of connection failure or disconnection
 */
void on_connected( xi_context_handle_t in_context_handle, void* data, xi_state_t state )
{
    xi_connection_data_t* conn_data = ( xi_connection_data_t* )data;

    switch ( conn_data->connection_state )
    {
        case XI_CONNECTION_STATE_OPEN_FAILED:
            UART_PRINT( "connection to %s:%d has failed reason %d\n", conn_data->host,
                        conn_data->port, state );

            xi_connect_to( in_context_handle, conn_data->host, conn_data->port,
                           conn_data->username, conn_data->password,
                           conn_data->connection_timeout, conn_data->keepalive_timeout,
                           conn_data->session_type, &on_connected );

            return;
        case XI_CONNECTION_STATE_OPENED:
            UART_PRINT( "connected to %s:%d\n", conn_data->host, conn_data->port );

            /* register a function to publish temperature data every 5 seconds */
            gSendTempratureHandle =
                xi_schedule_timed_task( in_context_handle, send_temprature, 5, 1, NULL );

            if ( XI_INVALID_TIMED_TASK_HANDLE == gSendTempratureHandle )
            {
                UART_PRINT( "send_temprature_task couldn't be registered\r\n" );
            }

